<a href="https://colab.research.google.com/github/niltontac/EspAnalise-EngDados/blob/master/Amazon.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
## Importing packages
# Importando bibliotecas
import pandas as pd
import numpy as np

In [0]:
## Loading dataset from file amazon.csv
# Carregando conjunto de dados do arquivo 
dataset=pd.read_csv("https://raw.githubusercontent.com/niltontac/EspAnalise-EngDados/master/amazon.csv",encoding = "ISO-8859-1")

In [3]:
## Shape of a dataset’s distribution
# Resumo da forma de distribuição do conjunto dos dados carregados
dataset.describe().T

         count         mean         std     min     25%     50%     75%     max
year    6454.0  2007.461729    5.746654  1998.0  2002.0  2007.0  2012.0  2017.0
number  6454.0   108.293163  190.812242     0.0     3.0    24.0   113.0   998.0

In [4]:
## The index (row labels) and range of the DataFrame.
## Data type of each column
# Índice de entradas e colunas
# Tipo de dados
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
year      6454 non-null int64
state     6454 non-null object
month     6454 non-null object
number    6454 non-null float64
date      6454 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

In [5]:
## Viewing the first lines
# Visualizando as primeiras linhas 
dataset.head()

   year state    month  number        date
0  1998  Acre  Janeiro     0.0  1998-01-01
1  1999  Acre  Janeiro     0.0  1999-01-01
2  2000  Acre  Janeiro     0.0  2000-01-01
3  2001  Acre  Janeiro     0.0  2001-01-01
4  2002  Acre  Janeiro     0.0  2002-01-01

In [6]:
## Viewing the last lines
# Visualizando as últimas linhas
dataset.tail()

      year      state     month  number        date
6449  2012  Tocantins  Dezembro   128.0  2012-01-01
6450  2013  Tocantins  Dezembro    85.0  2013-01-01
6451  2014  Tocantins  Dezembro   223.0  2014-01-01
6452  2015  Tocantins  Dezembro   373.0  2015-01-01
6453  2016  Tocantins  Dezembro   119.0  2016-01-01